app/controllers/randomgenerators_controller.rb

SELECT "randomgenerators".* FROM "randomgenerators" WHERE "randomgenerators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @randomgenerator = Randomgenerator.find(id) # look up movie by unique ID

SELECT "randomgenerators".* FROM "randomgenerators"
---
  def index
    @randomgenerators= Randomgenerator.all

INSERT INTO "randomgenerators" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 18 Dec 2013 03:14:38 UTC +00:00], ["title", nil], ["updated_at", Wed, 18 Dec 2013 03:14:38 UTC +00:00]]
---
  def create
    @randomgenerator = Randomgenerator.create(params[:randomgenerator])

SELECT "randomgenerators".* FROM "randomgenerators" WHERE "randomgenerators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @randomgenerator = Randomgenerator.find params[:id]

SELECT "randomgenerators".* FROM "randomgenerators" WHERE "randomgenerators"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "randomgenerators" SET "query" = 'Proclaim Christ, Christ the Center, Being Christ''s Disciple, Growing in Christlikeness' WHERE "randomgenerators"."id" = 8
---
  def update
    @randomgenerator = Randomgenerator.find params[:id]
    @randomgenerator.update_attributes!(params[:randomgenerator])

SELECT "randomgenerators".* FROM "randomgenerators" WHERE "randomgenerators"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "randomgenerators" WHERE "randomgenerators"."id" = ?  [["id", 6]]
---
  def destroy
    @randomgenerator = Randomgenerator.find(params[:id])
    @randomgenerator.destroy